app/controllers/api/v1/auth_controller.rb

  def create
    @user = User.find_by(username: user_login_params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "badabing"], ["LIMIT", 1]]

  def show
    jwt = request.headers['Authorization']
    id = JWT.decode(jwt, "winteriscoming")[0]["user_id"]
    @user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]