app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: User.all

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def update
    @user = User.find(params[:id])