app/controllers/application_controller.rb

    def current_user
      if decode_token
        user_id = decode_token['user_id']
        @user = User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]