app/controllers/category_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
        render json: Category.all