app/controllers/comment_controller.rb

    def index
        render json: Comment.all
---
SELECT "comments".* FROM "comments"

    def create
        @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("post_id", "created_at", "updated_at", "message", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 3], ["created_at", "2019-04-08 18:45:14.631158"], ["updated_at", "2019-04-08 18:45:14.631158"], ["message", "as"], ["user_id", 4]]

    def destroy
        Comment.find(params[:id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 9]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]